# SolutionIsOppositeToConnectionError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..SolutionIsOppositeToConnectionError Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The solution is in the opposite direction of the connection direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SolutionIsOppositeToConnectionError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SolutionIsOppositeToConnectionError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SolutionIsOppositeToConnectionError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace